uniljetstream/New_Workout_Plan/exerciser/sdkconfig.defaults
# ESP32-C3 Configuration
CONFIG_IDF_TARGET="esp32c3"

# WiFi Configuration
CONFIG_ESP_WIFI_SSID=""
CONFIG_ESP_WIFI_PASSWORD=""

# MQTT Configuration
CONFIG_MQTT_PROTOCOL_311=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Enable WiFi
CONFIG_ESP32_WIFI_ENABLED=y
